IRP/src/Catalogs/InterfaceGroups/InterfaceGroups.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>InterfaceGroups</name>
 <comment>Groups for form items</comment>
 <attributes>
  <name>FormPosition</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>10</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>Behavior</name>
  <type>
   <types>EnumRef.InterfaceGroupBehaviors</types>
  </type>
 </attributes>
 <attributes>
  <name>ChildFormItemsGroup</name>
  <type>
   <types>EnumRef.InterfaceGroupChildFormItemsGroups</types>
  </type>
 </attributes>
 <attributes>
  <name>Collapsed</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Enums/InterfaceGroupBehaviors/InterfaceGroupBehaviors.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>InterfaceGroupBehaviors</name>
 <enumValues>
  <name>Usual</name>
 </enumValues>
 <enumValues>
  <name>Collapsible</name>
 </enumValues>
 <enumValues>
  <name>PopUp</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/InterfaceGroups/Forms/ItemForm/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	LocalizationEvents.CreateMainFormItemDescription(ThisObject, "GroupDescriptions");
	ItemsVisibility();
	AddAttributesAndPropertiesServer.OnCreateAtServer(ThisObject);
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	AddAttributesAndPropertiesServer.BeforeWriteAtServer(ThisObject, Cancel, CurrentObject, WriteParameters);
EndProcedure

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	If EventName = "UpdateAddAttributeAndPropertySets" Then
		AddAttributesCreateFormControl();
	EndIf;
EndProcedure

&AtClient
Procedure AfterWrite(WriteParameters)
	Notify("UpdateAddAttributeAndPropertySets", New Structure(), ThisObject);
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure DescriptionOpening(Item, StandardProcessing) Export
	LocalizationClient.DescriptionOpening(Object, ThisObject, Item, StandardProcessing);
EndProcedure

&AtClient
Procedure ChildFormItemsGroupOnChange(Item)
	ItemsVisibility();
EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure ItemsVisibility()
	Items.Collapsed.Visible = Object.Behavior = Enums.InterfaceGroupBehaviors.Collapsible;
EndProcedure

#EndRegion

#Region AddAttributes

&AtClient
Procedure AddAttributeStartChoice(Item, ChoiceData, StandardProcessing) Export
	AddAttributesAndPropertiesClient.AddAttributeStartChoice(ThisObject, Item, StandardProcessing);
EndProcedure

&AtServer
Procedure AddAttributesCreateFormControl()
	AddAttributesAndPropertiesServer.CreateFormControls(ThisObject);
EndProcedure

&AtClient
Procedure AddAttributeButtonClick(Item) Export
	AddAttributesAndPropertiesClient.AddAttributeButtonClick(ThisObject, Item);
EndProcedure

#EndRegion
